#%c 格式化字符及其ASCII码
'%c' % 97           #结果'a'
'%c %c %c' % (97,98,99)         #结果'a b c'
'%c%c%c' % (97,98,99)           #结果'abc'
#注：a的ASCII码为97

#%s 格式化字符串
'%s %s%s' % (96,97,'a')         #'96 97a'
'%s %s%s' % (96,97,a)           # 报错

#%d 格式化整数
'%d * %d =%d' % (3,4,3*4)       #'3 * 4 =12'

#%o 格式化无符号八进制数
'%o ' % 500                     #'764 '

#%x 格式化无符号十六进制
'%x' % 500                      #'1f4'

#%X 格式化无符号十六进制（大写）
'%X' % 500                     #'1F4'

#%f 格式化定点数，可指定小数点后的精度(默认精确到六位)
'%f' % 27.667                   #'27.667000'

#%e 科学计数法,E为大写
'%e' % 1161489130000000         #'1.161489e+15'

#%g f和e的结合体，根据值的大小来确定使用%f或%e
'%g' % 27.667                   #'27.667'
'%g' % 1161489130000000         #'1.16149e+15'

#格式化操作符辅助命令 
#m.n m表示字符串最小总宽度，n是小数点后的位数，四舍五入
'%7.2f' % 27.667                #'  27.67'
'%.2e' % 27.667                 #'2.77e+01'

#%加-，-为左对齐
'%-7.2f' % 27.667                #'27.67  '

#%加+，在数字前加+
'%+7.2f' % 27.667                #' +27.67'
'%-+7.2f' % 27.667               #'+27.67 '
'%+-7.2f' % 27.667               #'+27.67 ' (同上)
'%+7.2f' % -27.667               #' -27.67'

# 在八进制前面加上零(' 0o')，在十六进制数前面显示' 0x'或' 0X'
'%#o' % 10                       #'0o12'
'%#x' % 500                      #'0x1f4'

# 0 数字前面用'0'取代空格

'%10.2e' % 10191116             #'  1.02e+07'
'%010.2e' % 10191116            #'001.02e+07'
'%-010.2e' % 10191116           #'1.02e+07  ' 空格未用0填充避免误会

# 转义字符含义 
"""
1. \' 单引号 
2. \“ 双引号 
3. \a 发出系统铃响声 
4. \b 退格符 
5. \n 换行符 
6. \t 横向制表位（tab） 
7. \v 纵向制表位 
8. \r 回车符 
9. \f 换页符 
10. \o 八进制数代表字符 
11. \x 十六进制数代表字符 
12. \0 空字符 
13. \ 反斜杠
"""